import { Component } from '@angular/core';
import {NavbarService} from "../../../../services/navbar.service";
import {Title} from "@angular/platform-browser";

@Component({
  selector: 'app-about-details',
  templateUrl: './about-details.component.html',
  styleUrls: ['./about-details.component.scss']
})
export class AboutDetailsComponent {
  detailList = [
    {
      class: "divar-history",
      title: "تاریخچه‌ٔ دیوار",
      description: "دیوار فعالیت خود را از ۲۱ تیر ۱۳۹۱ و با هدف ارائه بستری برای خرید و فروش بی‌واسطه در ایران شروع کرد. برند دیوار امروز تحت مالکیت شرکت «آگه پردازان هوشمند» فعالیت می‌کند. این شرکت در سال ۱۳۹۱ و با هدف سازمان‌دهی و توسعه بهتر خدمات آگهی آنلاین راه‌اندازی شد و در دستهٔ شرکت‌های دانش‌بنیان نوآور قرار گرفت.\n" +
        "\n" +
        "خدمات ثبت و مرور آگهی‌های دیوار در تمامی پلتفرم‌های پرطرفدار اعم از اندروید، iOS و وب در دسترس کاربران قرار دارد. اپلیکیشن اندرویدی دیوار در پایان شهریور ۱۴۰۱ بیشترین آمار دانلود و نصب فعال را در کشور پس از اپلیکیشن بازار با بیش از ۲۴.۴ میلیون نصب فعال در گوشی‌های اندرویدی به خود اختصاص داده است. خدمات انتشار و جست‌وجوی آگهی در دیوار درحال‌حاضر در بیش از ۳۷۰ شهر کشور در اختیار کاربران قرار دارد. آگهی‌ها در دسته‌های متنوعی از املاک، وسایل نقلیه و کالای دیجیتال تا استخدام و خدمات کسب‌وکار منتشر می‌شوند.\n" +
        "دیوار از سال ۱۳۹۹ در راستای کارآمدی بیشتر و ارائه خدمات به کسب‌وکارها، با ایجاد تغییراتی، سرویس‌هایی اختصاصی را برای کسب‌وکارهای فعال در پلتفرم خود راه‌اندازی کرد تا صاحبان مشاغل، با سرعت و آسودگی بیشتری فرآیند فروش کالا و خدمات خود را در صفحه‌های اختصاصی انجام دهند. از این خدمات در حال حاضر می‌توان به پنل آژانس و مشاوران املاک، پنل اختصاصی برای نمایشگاه‌های خودرو و پنل فروشگاهی دیوار اشاره کرد. فروشندگان کالا می‌توانند روی دیوار صاحب شعبه‌ای آنلاین و اختصاصی شوند و به مجموعه مشتریان چند ده میلیونی دیوار دسترسی داشته باشند.\n" +
        "دیوار با بهره‌مندی از زیرساخت قوی و فناوری‌های پیشرفته، فرآیندهای توسعه و بهبود خدمات خود را به‌صورت ادامه‌دار در دستور کار دارد. تیم‌های فنی و پشتیبانی دیوار با استفاده از ابزارهایی همچون زیرساخت ابری، یادگیری ماشینی، پردازش تصویر، پردازش زبان طبیعی و دیگر فناوری‌های به‌روز، فرآیند انتشار، جست‌وجو، فیلتر کردن و ارتباط در آگهی‌ها را روز‌به‌روز برای کاربران بهبود می‌بخشند.\n" +
        "فرآیند توسعه و بهینه‌سازی خدمات، جزو جدانشدنی دیوار است. ما همیشه در تلاش هستیم تا در مسیر حفظ جایگاه بزرگ‌ترین مرجع نیازمندی‌های آنلاین در ایران، با توجه به بازخوردهای کاربران و بررسی‌های دائمی، خدمات جدیدتر و بهتری را به مجموعه خود اضافه کنیم."
    },
    {
      class: "responsibility",
      title: "مسئولیت اجتماعی دیوار",
      description: "دیوار بستری برای فعالیت ۵۳ میلیون گوشی یکتا در سال ۱۴۰۰ بوده است. انتشار روزانهٔ بیش از ۳۸۳ هزار آگهی و ۱۵۲ میلیون بازدید در روز، دیوار را به یکی از پلتفرم‌های تاثیرگذار در بستر آنلاین کشور تبدیل کرده است.\n" +
        "از این رو، دیوار صرفاً یک کسب‌وکار ساده نیست و تمام تلاش خود را می‌کند تا بتواند نقش و مسئولیت خود را در قبال کاربران، جامعه و محیط زیست ایفا کند. علاوه بر این، تمام افرادی که به دیوار می‌پیوندند می‌توانند در تعریف و اجرای پروژه‌های مرتبط با مسئولیت اجتماعی نقش داشته باشند. اقداماتی از جمله کمک به مؤسسات مردم‌نهاد برای حفظ و حراست از جنگل‌های زاگرس، ایجاد امکان گزارش کاربر در چت دیوار برای افزایش امنیت زنان، ایجاد امکان استفاده از اپلیکیشن برای افراد کم‌بینا و حذف آگهی‌های مربوط به خرید و فروش گونه‌های ممنوعهٔ‌ جانوری، تنها نمونه‌هایی از فعالیت‌های دیوار در راستای مسئولیت اجتماعی است."
    },
    {
      class: "cooperation-container",
      title: "همکاران تجاری دیوار",
      description: "دیوار در مسیر توسعه و گسترش خدمات و همچنین برطرف کردن قسمتی از نیازهای عملیاتی خود، سرویس‌های جدیدی را در قالب شرکت‌های جدید ارائه نماید. دیوار در کنار کارنامه و پیشگامان، مجموعه‌ای از خدمات کاربردی را به کاربران خود ارائه می‌دهد."
    }
  ]
  cooperationList = [
    {
      class: "karnameh",
      img: "assets/images/carnameh.svg",
      title: "کارنامه",
      linkText: "karnameh.ir",
      description: "کارنامه از پاییز ۱۳۹۸ با هدف خلق تجربه کاربری بهتر در خرید و فروش خودرو و به عنوان یک سرویس مکمل دیوار در حوزه خودرو، کار خود را آغاز کرد. این سرویس در نظر دارد تا به دستیار مطمئن ایرانیان در خرید و فروش خودرو تبدیل شود و خدمات کارشناسی خودرو در محل و فروش سفارشی را به کاربران ارائه می‌کند.\n" +
        "در سرویس فروش سفارشی کارنامه، بعد از کارشناسی فنی و بدنه و تخمین قیمت، تمامی فرایندهای درج و انتشار آگهی، پاسخگویی به خریداران، هماهنگی بازدید و مشاوره جهت عقد قرارداد فروش خودرو را در مدت ۵ تا ۷ روز برای کاربران انجام می‌دهد.\n" +
        "از دیگر سرویس‌های کارنامه می‌توان به «خرید سفارشی» نیز اشاره کرد که بسته به نیاز و بودجه مشتریان، خودروهای کارشناسی شده مناسب به آنها پیشنهاد شده تا فرآیند خرید خودرو بسیار ساده‌تر از قبل باشد.\n" +
        "کارنامه هم مانند همه مجموعه‌های نوآور، فرایندهای توسعه را در دستور کار دارد و به‌زودی خدمات دیگری نیز به مجموعه خدمات خود اضافه خواهد کرد.",
      descriptionClass: "py-[1.35rem]"
    },
    {
      class: "pishgaman",
      img: "assets/images/pishgaman.svg",
      title: "پیشگامان",
      linkText: "Pishgaman Arman",
      description: "شریک تجاری دیگر دیوار، مسئولیت نظارت بر آگهی و بخشی از پشتیبانی مشتریان را برعهده دارد. پیشگامان، به‌عنوان یک شرکت مستقل در کنار دیوار همکاری می‌کند و به‌نوعی بازوی اصلی پشتیبانی و ارتباط نزدیک با کاربران محسوب می‌شود.\n" +
        "نظارت کامل بر آگهی‌های دیوار و مدیریت آن‌ها، مسئولیت اصلی شرکت پیشگامان است. این شرکت هم برنامه‌های توسعه‌ای و افزایش خدمات را در دستور کار دارد و به‌زودی، سرویس‌های جدیدی را به مجموعه خود اضافه می‌کند.",
      descriptionClass: "pt-[1.6rem]"
    }
  ]
  title = "تاریخچهٔ دیوار: گذشته‌ٔ دیوار را دقیق‌تر ببینید"

  constructor(private navbar: NavbarService, private titleService: Title) {
    this.navbar.showNavbar = true;
    setTimeout(() => {
      this.navbar.shouldActivated = 'all';
    }, 500)
    this.titleService.setTitle(this.title)
  }
}
